core/app/Http/Controllers/Api/Central/DashboardController.php

    public function index(): JsonResponse
    {
        try {
            // Use file cache instead of Redis to avoid configuration issues
            $stats = cache()->remember('central_dashboard_stats', 300, function () {
                // Get all counts in parallel queries
                $tenantStats = Tenant::selectRaw('
                    COUNT(*) as total_tenants,
                    SUM(CASE WHEN user_id IS NOT NULL THEN 1 ELSE 0 END) as active_tenants
                ')->first();
---
select
COUNT(*) as total_tenants,
SUM(CASE WHEN user_id IS NOT NULL THEN 1 ELSE 0 END) as active_tenants
from `tenants` limit 1

    public function stats(): JsonResponse
    {
        try {
            // Use file cache instead of Redis to avoid configuration issues
            $stats = cache()->remember('central_dashboard_stats_detailed', 300, function () {
                // Optimize with selectRaw
                $tenantStats = Tenant::selectRaw('
                    COUNT(*) as total,
                    SUM(CASE WHEN user_id IS NOT NULL THEN 1 ELSE 0 END) as active,
                    SUM(CASE WHEN user_id IS NULL THEN 1 ELSE 0 END) as inactive
                ')->first();

                $userStats = User::selectRaw('
                    COUNT(*) as total,
                    SUM(CASE WHEN email_verified = 1 THEN 1 ELSE 0 END) as verified,
                    SUM(CASE WHEN email_verified = 0 THEN 1 ELSE 0 END) as unverified
                ')->first();

                $orderStats = PaymentLogs::selectRaw('
                    COUNT(*) as total,
                    SUM(CASE WHEN payment_status = ? THEN 1 ELSE 0 END) as pending,
                    SUM(CASE WHEN payment_status = ? THEN 1 ELSE 0 END) as complete,
                    SUM(CASE WHEN payment_status = ? THEN 1 ELSE 0 END) as failed
                ', ['pending', 'complete', 'failed'])->first();

                $revenue = PaymentLogs::where('payment_status', 'complete')
                    ->selectRaw('
                        SUM(package_price) as total,
                        SUM(CASE WHEN MONTH(created_at) = ? AND YEAR(created_at) = ? THEN package_price ELSE 0 END) as monthly,
                        SUM(CASE WHEN YEAR(created_at) = ? THEN package_price ELSE 0 END) as yearly
                    ', [now()->month, now()->year, now()->year])
                    ->first();
---
select
COUNT(*) as total,
SUM(CASE WHEN user_id IS NOT NULL THEN 1 ELSE 0 END) as active,
SUM(CASE WHEN user_id IS NULL THEN 1 ELSE 0 END) as inactive
from `tenants` limit 1
select
COUNT(*) as total,
SUM(CASE WHEN email_verified = 1 THEN 1 ELSE 0 END) as verified,
SUM(CASE WHEN email_verified = 0 THEN 1 ELSE 0 END) as unverified
from `users` where `users`.`deleted_at` is null limit 1
select
COUNT(*) as total,
SUM(CASE WHEN payment_status = 'pending' THEN 1 ELSE 0 END) as pending,
SUM(CASE WHEN payment_status = 'complete' THEN 1 ELSE 0 END) as complete,
SUM(CASE WHEN payment_status = 'failed' THEN 1 ELSE 0 END) as failed
from `payment_logs` limit 1
select
SUM(package_price) as total,
SUM(CASE WHEN MONTH(created_at) = 11 AND YEAR(created_at) = 2025 THEN package_price ELSE 0 END) as monthly,
SUM(CASE WHEN YEAR(created_at) = 2025 THEN package_price ELSE 0 END) as yearly
from `payment_logs` where `payment_status` = 'complete' limit 1

    public function recentOrders(): JsonResponse
    {
        try {
            // Cache recent orders for 1 minute using file cache
            $recentOrders = cache()->remember('central_recent_orders', 60, function () {
                return PaymentLogs::with(['user:id,name,email', 'package:id,title,price'])
                    ->select('id', 'name', 'email', 'package_name', 'package_price', 'payment_status', 'created_at', 'user_id', 'package_id')
                    ->latest()
                    ->limit(10)
                    ->get();
---
select `id`, `name`, `email`, `package_name`, `package_price`, `payment_status`, `created_at`, `user_id`, `package_id` from `payment_logs` order by `created_at` desc limit 10