core/app/Http/Controllers/Api/Central/PaymentController.php

select count(*) as aggregate from `payment_logs`
---
    public function index(Request $request): AnonymousResourceCollection
    {
        $query = PaymentLogs::with(['user', 'package', 'tenant']);

        // Filter by payment status
        if ($request->has('payment_status')) {
            $query->where('payment_status', $request->payment_status);
        }

        // Filter by tenant
        if ($request->has('tenant_id')) {
            $query->where('tenant_id', $request->tenant_id);
        }

        // Filter by date range
        if ($request->has('from_date')) {
            $query->whereDate('created_at', '>=', $request->from_date);
        }
        if ($request->has('to_date')) {
            $query->whereDate('created_at', '<=', $request->to_date);
        }

        $payments = $query->latest()->paginate(20);