core/app/Http/Controllers/Api/Central/TenantController.php

select * from `domains` where `domains`.`tenant_id` in ('arom', 'aromat', 'aromatic', 'bookpoint', 'casual', 'dsdsd', 'electro', 'funky', 'furniture', 'hexfashion', 'medicom', 'testdemo', 'werewr')
select * from `payment_logs` where `payment_logs`.`tenant_id` in ('arom', 'aromat', 'aromatic', 'bookpoint', 'casual', 'dsdsd', 'electro', 'funky', 'furniture', 'hexfashion', 'medicom', 'testdemo', 'werewr') order by `created_at` desc
select * from `tenants` order by `created_at` desc limit 20 offset 0
select * from `users` where `users`.`id` in (10) and `users`.`deleted_at` is null
---
    public function index(Request $request): AnonymousResourceCollection
    {
        $page = $request->get('page', 1);
        $key = $this->getCacheKey("central_tenants_list_page_{$page}");

        $tenants = $this->remember($key, $this->getListsTtl(), function () {
            return Tenant::with(['user', 'domains', 'payment_log'])
                ->orderBy('created_at', 'desc')
                ->paginate(20);
        }, ['tag:tenants', 'tag:central']);