core/plugins/PageBuilder/Addons/Common/Footer/FooterUsefulLinks.php

    public function frontend_render()
    {
        $title = SanitizeInput::esc_html($this->setting_item('title') ?? __('Useful Links'));
        $enable_home = (bool)($this->setting_item('enable_home') ?? true);
        $enable_products = (bool)($this->setting_item('enable_products') ?? true);
        $enable_categories = (bool)($this->setting_item('enable_categories') ?? true);
        $enable_blog = (bool)($this->setting_item('enable_blog') ?? true);
        $alignment = SanitizeInput::esc_html($this->setting_item('alignment') ?? 'left');
        $padding_top = SanitizeInput::esc_html($this->setting_item('padding_top'));
        $padding_bottom = SanitizeInput::esc_html($this->setting_item('padding_bottom'));
        $section_id = SanitizeInput::esc_html($this->setting_item('section_id')) ?? '';

        // Get Home URL
        $home_url = null;
        $home_label = __('Home');
        if ($enable_home) {
            $home_page_id = get_static_option('home_page');
            if ($home_page_id) {
                $home_page = \App\Models\Page::find($home_page_id);
---
select * from `pages` where `pages`.`id` = '1' limit 1