core/plugins/PageBuilder/Addons/Common/Footer/FooterPagesLinks.php

    public function frontend_render()
    {
        $title = SanitizeInput::esc_html($this->setting_item('title') ?? __('Important Pages'));
        $alignment = SanitizeInput::esc_html($this->setting_item('alignment') ?? 'left');
        $padding_top = SanitizeInput::esc_html($this->setting_item('padding_top'));
        $padding_bottom = SanitizeInput::esc_html($this->setting_item('padding_bottom'));
        $section_id = SanitizeInput::esc_html($this->setting_item('section_id')) ?? '';

        $excluded_page_ids = $this->setting_item('excluded_page_ids') ?? '';
        $excluded_ids = [];
        if (!empty($excluded_page_ids)) {
            $excluded_ids = array_filter(array_map('trim', explode(',', $excluded_page_ids)));
            $excluded_ids = array_map('intval', $excluded_ids);
        }

        // Get pages
        $pages_query = Page::where('status', 1)->with('slug');

        if (!empty($excluded_ids)) {
            $pages_query->whereNotIn('id', $excluded_ids);
        }

        $pages = $pages_query->get();
---
select * from `pages` where `status` = 1