core/app/Models/PageBuilder.php

    public static function getCachedSettings(int $widget_id): ?array
    {
        try {
            // Try to get from Redis cache first
            if (class_exists(TenantCacheServiceProvider::class)) {
                $cacheKey = TenantCacheServiceProvider::getTenantCacheKey(
                    "pagebuilder_widget_{$widget_id}"
                );

                $cached = Cache::store('redis')->get($cacheKey);
                if ($cached !== null) {
                    return $cached;
                }
            }

            // Fallback to legacy cache format
            $legacyCache = Cache::get('widget_settings_cache' . $widget_id);
            if ($legacyCache !== null) {
                return $legacyCache;
            }

            // Fallback to database
            $widget = static::find($widget_id);
---
select * from `page_builders` where `page_builders`.`id` = 21 limit 1