core/app/Http/Controllers/Landlord/Admin/LandlordAdminController.php

    public function dashboard(){

        $total_admin= Admin::count();

        $total_user = 0;

        $update_info = [];
        try{
             $total_user= User::count();
             $update_info = UpdateInfo::whereNull('read_at')->get();
        }catch(\Exception $e){

        }

        $all_tenants = Tenant::whereValid()->count();
        $total_price_plan = PricePlan::count();
        $total_brand = Brand::all()->count();
        $total_testimonial = Testimonial::all()->count();
        $recent_order_logs = PaymentLogs::orderBy('id','desc')->take(5)->get();
---
select count(*) as aggregate from `admins`
select count(*) as aggregate from `users` where `users`.`deleted_at` is null
select * from `update_infos` where `read_at` is null
select count(*) as aggregate from `price_plans`
select * from `payment_logs` order by `id` desc limit 5

    public function get_chart_data_month(Request $request){
        /* -------------------------------------
            TOTAL ORDER BY MONTH CHART DATA
        ------------------------------------- */
        $all_donation_by_month = PaymentLogs::select('package_price','created_at')->where(['payment_status' => 'complete'])
            ->whereYear('created_at',date('Y'))
            ->get()
            ->groupBy(function ($query){
                return Carbon::parse($query->created_at)->format('F');
            })->toArray();
---
select `package_price`, `created_at` from `payment_logs` where (`payment_status` = 'complete') and year(`created_at`) = '2025'