core/app/Http/Controllers/Landlord/Admin/PageBuilderController.php

    public function get_widget_settings(Request $request){
        try {
            $widget_id = $request->widget_id;

            if(empty($widget_id)){
                return response()->json([
                    'success' => false,
                    'message' => 'Widget ID is required'
                ], 400);
            }

            $widget = PageBuilder::findOrFail($widget_id);
---
select * from `page_builders` where `page_builders`.`id` = '12' limit 1

    public function get_preview(Request $request){
        try {
            $page_id = $request->page_id;
            $location = $request->location ?? 'dynamic_page';
            $page_type = $request->page_type ?? 'dynamic_page';

            $html = '';

            // Header with widget IDs
            $headerContent = \App\Facades\ThemeDataFacade::renderPageBuilderHeader();
            if(empty($headerContent)){
                $headerWidgets = PageBuilder::where(['addon_location' => 'header'])
                    ->orderBy('addon_order', 'ASC')
                    ->get();

                $headerContent = '';
                foreach($headerWidgets as $widget){
                    $widgetHtml = PageBuilderSetup::render_widgets_by_name_for_frontend([
                        'name' => $widget->addon_name,
                        'namespace' => $widget->addon_namespace,
                        'id' => $widget->id,
                    ]);
                    // Wrap with data-widget-id
                    $headerContent .= '<div data-widget-id="' . $widget->id . '" class="pb-preview-widget">' . $widgetHtml . '</div>';
                }
            }
            $html .= '<div class="pb-preview-header">' . $headerContent . '</div>';

            // Page Content with widget IDs
            if($page_id){
                $pageWidgets = PageBuilder::where([
                    'addon_page_type' => $page_type,
                    'addon_page_id' => $page_id
                ])->orderBy('addon_order', 'ASC')->get();
---
select * from `page_builders` where (`addon_page_type` = 'dynamic_page' and `addon_page_id` = '1') order by `addon_order` asc