core/app/Http/Controllers/Landlord/Admin/PricePlanController.php

    public function edit_price_plan($id){
        $plan = PricePlan::find($id);
---
select * from `price_plans` where `price_plans`.`id` = '9' limit 1

    public function update(Request $request){
        $type_validation  = tenant() ? 'nullable' : 'required';
        $this->validate($request,[
            'id' => 'required|integer',
            'title' => 'required|string',
            'package_badge' => 'required|string',
            'package_description' => 'nullable|string',
            'features' => 'required',
            'themes' => 'required',
            'payment_gateways' => 'required',
            'type' => ''.$type_validation.'|integer',
            'price' => 'required|numeric',
            'status' => 'required|integer',
            'page_permission_feature'=> 'nullable|integer|min:-1',
            'blog_permission_feature'=> 'nullable|integer|min:-1',
            'product_permission_feature'=> 'nullable|integer|min:-1',
            'storage_permission_feature'=> 'required|integer|min:-1',
        ]);

        try {
            //create data for price plan
            $price_plan = PricePlan::find($request->id);
---
select * from `price_plans` where `price_plans`.`id` = '13' limit 1

            $price_plan->save();

            if (!tenant()) {
                $price_plan->plan_features()->delete();
                $features = $request->features;
                foreach ($features as $feat) {
                    PlanFeature::where('plan_id', $price_plan->id)->create([
                        'plan_id' => $price_plan->id,
                        'feature_name' => $feat,
                    ]);
                }
            }

            $price_plan->plan_themes()->delete();
            $themes = $request->themes;
            foreach ($themes as $theme) {
                PlanTheme::create([
                    'plan_id' => $price_plan->id,
                    'theme_slug' => $theme,
                ]);
            }

            $price_plan->plan_payment_gateways()->delete();
---
delete from `plan_features` where `plan_features`.`plan_id` = 13 and `plan_features`.`plan_id` is not null
insert into `plan_features` (`plan_id`, `feature_name`, `updated_at`, `created_at`) values (13, 'pages', '2025-11-05 01:47:06', '2025-11-05 01:47:06')
delete from `plan_themes` where `plan_themes`.`plan_id` = 13 and `plan_themes`.`plan_id` is not null
insert into `plan_themes` (`plan_id`, `theme_slug`, `updated_at`, `created_at`) values (13, 'hexfashion', '2025-11-05 01:47:06', '2025-11-05 01:47:06')
delete from `plan_payment_gateways` where `plan_payment_gateways`.`plan_id` = 13 and `plan_payment_gateways`.`plan_id` is not null

                {
                    continue;
                }
                PlanPaymentGateway::create([
                    'plan_id' => $price_plan->id,
                    'payment_gateway_name' => $gateway,
                ]);
---
insert into `plan_payment_gateways` (`plan_id`, `payment_gateway_name`, `updated_at`, `created_at`) values (13, 'paypal', '2025-11-05 01:47:06', '2025-11-05 01:47:06')