core/app/Http/Services/DynamicRouteManager.php

    public static function handle($slug)
    {
        $slugData = Slug::where('slug', $slug)->first();
---
select * from `slugs` where `slug` = 'about' limit 1

    private static function handleTenantPage($slug)
    {
        $page_post = Page::where('slug', $slug)->first();
---
select * from `pages` where `slug` = 'about' limit 1