core/plugins/PageBuilder/Addons/Common/PricingTable/PricingTable.php

    public function frontend_render()
    {
        $title = SanitizeInput::esc_html($this->setting_item('title')) ?? '';
        $subtitle = SanitizeInput::esc_html($this->setting_item('subtitle')) ?? '';
        $padding_top = SanitizeInput::esc_html($this->setting_item('padding_top'));
        $padding_bottom = SanitizeInput::esc_html($this->setting_item('padding_bottom'));

        $order_by = SanitizeInput::esc_html($this->setting_item('order_by')) ?? 'id';
        $order = SanitizeInput::esc_html($this->setting_item('order')) ?? 'asc';

        // Get tenant's price plans
        $all_price_plan = \App\Models\PricePlan::with('plan_features')
            ->where('status', 1)
            ->orderBy($order_by, $order)
            ->get()
            ->groupBy('type');

        $plan_types = \App\Models\PricePlan::where('status', 1)
            ->orderBy('type', 'asc')
            ->select('type')
            ->distinct()
            ->pluck('type');
---
select * from `price_plans` where `status` = 1 order by `id` asc
select distinct `type` from `price_plans` where `status` = 1 order by `type` asc