core/app/Http/Controllers/Tenant/Admin/FooterBuilderController.php

select * from `page_builders` where `page_builders`.`id` = '27' limit 1
---
    public function update(Request $request)
    {
        $this->validate($request, [
            'addon_name' => 'required',
            'addon_namespace' => 'required',
            'addon_order' => 'nullable',
        ]);

        unset($request['_token']);
        $addon_content = (array) $request->all();

        // Clear cache
        $tenant_id = !is_null(tenant()) ? tenant()->id : 0;
        Cache::forget('widget_settings_cache' . $request->id);
        Cache::forget('pagebuilder_footer_exists_' . $tenant_id);
        Cache::forget('pagebuilder_footer_content_' . $tenant_id);

        PageBuilder::findOrFail($request->id)->update([
            'addon_type' => $request->addon_type,
            'addon_location' => 'footer', // Force location to footer
            'addon_name' => $request->addon_name,
            'addon_namespace' => base64_decode($request->addon_namespace),
            'addon_order' => $request->addon_order ?? 0,
            'addon_settings' => json_encode($addon_content),
        ]);