core/app/Http/Controllers/Tenant/Admin/TenantDashboardController.php

    public function dashboard(){

        $theme_meta_instance = MetaDataHelpers::Init();
        $theme_info = $theme_meta_instance->getThemesInfo();
        $theme_name = get_static_option('tenant_admin_dashboard_theme') ?? '';
        $render_view_file = $theme_meta_instance->getThemeOverrideViews($theme_name,'dashboard',self::BASE_PATH.'admin-home');
        //todo:: remove the test code
        $total_admin = Admin::count();
        $total_user= User::count();
        $all_blogs = Blog::count();

        // Only get products count if tenant has products permission
        $total_products = 0;
        if (tenant_plan_sidebar_permission('products')) {
            $total_products = Product::count();
        }

        $total_orders = ProductOrder::count();
        $total_sale = ProductOrder::where('payment_status', 'success')->sum('total_amount');
//        $current_package = tenant()->payment_log;
        $current_package = PaymentLogs::where('id', tenant()->renewal_payment_log_id)->first();

        $recent_order_logs = ProductOrder::orderBy('id','desc')->select('id','name', 'email', 'total_amount', 'payment_gateway', 'payment_status', 'status','created_at')->take(10)->get();
---
select count(*) as aggregate from `admins`
select count(*) as aggregate from `users` where `users`.`deleted_at` is null
select count(*) as aggregate from `blogs`
select count(*) as aggregate from `products` where `products`.`deleted_at` is null
select count(*) as aggregate from `product_orders`
select sum(`total_amount`) as aggregate from `product_orders` where `payment_status` = 'success'
select * from `payment_logs` where `id` = 168 limit 1
select `id`, `name`, `email`, `total_amount`, `payment_gateway`, `payment_status`, `status`, `created_at` from `product_orders` order by `id` desc limit 10