core/app/Http/Controllers/Central/V1/WebApiController.php

select count(*) as aggregate from `admins`
select count(*) as aggregate from `users` where `users`.`deleted_at` is null
select count(*) as aggregate from `price_plans`
---
    public function dashboardStats(): JsonResponse
    {
        $total_admin = Admin::count();
        $total_user = User::count();
        $all_tenants = Tenant::whereValid()->count();
        $total_price_plan = PricePlan::count();