core/app/Http/Controllers/Central/V1/WebApiController.php

select count(*) as aggregate from `tenants` where `user_id` is not null
---
    public function dashboardStats(): JsonResponse
    {
        $cacheKey = $this->getCacheKey('dashboard:stats');
        $ttl = $this->getStatsTtl();

        $data = $this->remember($cacheKey, $ttl, function () {
            $total_admin = Admin::count();
            $total_user = User::count();
            $all_tenants = Tenant::whereValid()->count();
            $total_price_plan = PricePlan::count();

            return [
                'total_admins' => $total_admin,
                'total_users' => $total_user,
                'total_tenants' => $all_tenants,
                'total_packages' => $total_price_plan,
            ];
        }, ['tag:dashboard']);