core/app/Helpers/funtions.php

function get_static_option($option_name, $default = null)
{
    $value = Cache::remember($option_name, 24 * 60 * 60, function () use ($option_name) {
        try {
            return StaticOption::where('option_name', $option_name)->first();
---
select * from `static_options` where `option_name` = 'timezone' limit 1

function get_static_option_central($option_name, $default = null)
{
    $value = Cache::remember($option_name, 60, function () use ($option_name) {
        try {
            return \App\Models\StaticOptionCentral::where('option_name', $option_name)->first();
---
select * from `static_option_centrals` where `option_name` = 'storage_driver' limit 1

function tenant_has_digital_product()
{
    $digital_product = false;
    $tenant = !empty($tenant) ? $tenant : tenant();
    $current_tenant_payment_data = PaymentLogs::where('id', $tenant->renewal_payment_log_id)->first() ?? [];
---
select * from `payment_logs` where `id` = 168 limit 1

function get_attachment_image_by_id($id, $size = null, $default = false)
{
    $image_details = Cache::remember('media_image_' . $id, 60 * 60 * 24, function () use ($id) {
        return \App\Models\MediaUploader::find($id);
---
select * from `media_uploaders` where `media_uploaders`.`id` is null limit 1

function get_default_language()
{
    $defaultLang = \App\Models\Language::where('default', 1)->first();

    $fallback_lang = \App\Models\Language::where('slug', 'en_GB')->first();
---
select * from `languages` where `default` = 1 limit 1
select * from `languages` where `slug` = 'en_GB' limit 1

function get_page_slug($id, $default = null)
{
    return \App\Models\Page::where('id', $id)->first()->slug ?? $default;
---
select * from `pages` where `id` = '5' limit 1

function render_frontend_sidebar($location, $args = [])
{
    $output = '';
    $all_widgets = \App\Models\Widgets::where(['widget_location' => $location])->orderBy('widget_order', 'ASC')->get();
---
select * from `widgets` where (`widget_location` = 'footer') order by `widget_order` asc

function get_user_lang_direction()
{
    $default = \App\Models\Language::where('default', 1)->first();
    $user_direction = \App\Models\Language::where('slug', session()->get('lang'))->first();

    $fallback_lang = \App\Models\Language::where('slug', 'en_GB')->first();
---
select * from `languages` where `default` = 1 limit 1
select * from `languages` where `slug` is null limit 1
select * from `languages` where `slug` = 'en_GB' limit 1

function render_payment_gateway_for_price_plan(bool $cash_on_delivery = false, bool $is_price_plan = false)
{
    $output = '<div class="payment-gateway-wrapper">';
    $output .= '<input type="hidden" name="selected_payment_gateway" value="' . get_static_option('site_default_payment_gateway') . '">';

    $all_gateway = PaymentGateway::select('id','name','image')->get()->toArray() ?? [];
---
select `id`, `name`, `image` from `payment_gateways`

function tenant_plan_sidebar_permission($permission_name, $tenant = null) // Plan based admin sidebar permission
{
    $inventory = false;

    $tenant = !empty($tenant) ? $tenant : tenant();

    // Check if tenant exists and has renewal_payment_log_id
    if (empty($tenant) || empty($tenant->renewal_payment_log_id)) {
        return false;
    }

    $current_tenant_payment_data = PaymentLogs::where('id', $tenant->renewal_payment_log_id)->first() ?? [];
    if (!empty($current_tenant_payment_data)) {
        $package = $current_tenant_payment_data->package;
        if (!empty($package)) {
            // Only get active features (status = 1)
            $features = $package->plan_features()
                ->where('status', 1)
                ->pluck('feature_name')
                ->toArray();
---
select * from `payment_logs` where `id` = 168 limit 1
select `feature_name` from `plan_features` where `plan_features`.`plan_id` = 13 and `plan_features`.`plan_id` is not null and `status` = 1