core/app/Helpers/SidebarMenuHelper.php

select * from `payment_logs` where `id` = 168 limit 1
---
    public function render_tenant_sidebar_menus(): string
    {
//         $current_tenant_payment_data = tenant()->payment_log ?? []; // pricing_plan_id => 13   (old)
        $current_tenant_payment_data = PaymentLogs::where('id', tenant()->renewal_payment_log_id)->first() ?? []; // pricing_plan_id => 1 (new)

select * from `payment_logs` where `id` = 168 limit 1
---
    private function tenant_admin_manage_menus(MenuWithPermission $menu_instance): void
    {
//        $current_tenant_payment_data = tenant()->payment_log ?? [];
        $current_tenant_payment_data = PaymentLogs::where('id', tenant()->renewal_payment_log_id)->first();