core/app/Helpers/SidebarMenuHelper.php

    private function tenant_admin_manage_menus(MenuWithPermission $menu_instance): void
    {
//        $current_tenant_payment_data = tenant()->payment_log ?? [];
        $current_tenant_payment_data = PaymentLogs::where('id', tenant()->renewal_payment_log_id)->first();
---
select * from `payment_logs` where `id` = 168 limit 1