core/app/Helpers/ThemeMetaData.php

    public function hasPageBuilderHeader(): bool
    {
        $tenant_id = !is_null(tenant()) ? tenant()->id : 0;
        $cache_key = 'pagebuilder_header_exists_' . $tenant_id;

        return \Cache::remember($cache_key, 60 * 60, function () {
            return \App\Models\PageBuilder::where('addon_location', 'header')->exists();
---
select exists(select * from `page_builders` where `addon_location` = 'header') as `exists`

    public function hasPageBuilderFooter(): bool
    {
        $tenant_id = !is_null(tenant()) ? tenant()->id : 0;
        $cache_key = 'pagebuilder_footer_exists_' . $tenant_id;

        return \Cache::remember($cache_key, 60 * 60, function () {
            return \App\Models\PageBuilder::where('addon_location', 'footer')->exists();
---
select exists(select * from `page_builders` where `addon_location` = 'footer') as `exists`